#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<string.h>
//
//int main()
//{
//	unsigned char a = 200;
//	//unsigned char--1个字节-8个比特位--无符号位可言--范围 0-255
//	//00000000--0
//	//00000001--1
//	//11111111--255
//
//	unsigned char b = 100;
//
//	unsigned char c = 0;//---300但是放不下
//	c = a + b;//发生整形提升
//	//a+b是两个char类型的变量相加--会进行整形提升
//	//00000000 00000000 00000000 11001000
//	//11001000-a
//	// a进行整形提升 如何进行整形提升的
//	// 因为a是无符号的char 故直接补0，补齐32位
//	// 如果a是char类型，直接按照符号位补
//
//	//00000000 00000000 00000000 11001000-   a整形提升后的结果
//
//
//
//	//01101000-b
//	//00000000 00000000 00000000 01101000-   b整形提升后的结果
//
//	// 再进行相加
//	//00000000 00000000 00000000 11001000
//	//00000000 00000000 00000000 01100100
//	//00000000 00000000 00000001 00101100-  相加后的结果
//	//加完后的结果放在c里面--只能存放8个比特位
//	//00101100--c
//
//	printf("%d %d", a + b, c);
//	//a+b以%d的形式进行打印的意思就是十进制的有符号数字--内存中存的有符号的补码
//	//00000000 00000000 00000001 00110000--正数---原反补相同直接翻译--300
//
//	//c以%d的形式打印 --- 只能对c进行整形提升
//	//00000000 00000000 00000000 00101100--我们认为这是有符号位的补码
//
//	return 0;
//}



//在32位大端模式处理器上变量b等于
//int main()
//{
//	unsigned int a = 0x1234;//--2个字节
//	//0x1234 == 0x 00 00 12 34
//
//	//内存
//
//	//低地址  ------------------------------------------》      高地址
//	       //00 00 12 34                  34 12 00 00
//	      //  大端字节序存储模式         小端字节序存储模式
//
//
//	unsigned char b = *(unsigned char*)&a;
//	//&a 把a的地址强制转换成（unsigned char *）类型---在解引用可以访问一个字节的内容
//	// 00 00 12 34
//	//故解引用是 0x 00
//
//	printf("%d\n", b);
//
//	return 0;
//}


//int main()
//{
//	char a[1000] = { 0 };
//	//有符号的char的范围是 -128  -》   127
//	//10000000--补码
//	//10000001--反码
//	//11111110--源码   127
//
//	//00000000--补码
//	//00000001--反码
//	//01111110--源码  
//
//
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	//i=0    -1
//	//i=1    -2
//	//i=127  -128
//	//i=128  127
//	//        3       
//	//        2
//	//        1
//	//        0
//
//	printf("%d\n", strlen(a));
//	return 0;
//}


//打印杨辉三角 
//         1
//        1 1
//      1  2  1
//    1   3  3  1
//  1   4   6  4   1
//

//  1
//  1 1
//  1 2 1
//  1 3 3 1
//  1 4 6 4 1
//


//  1
//  1 1
//  1 0 1
//  1 0 0 1
//  1 0 0 0 1

//int main()
//{
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j < 10; j++)
//		{
//			if (j == 0)
//			{
//				arr[i][j] = 1;
//			}
//			if (i == j)
//			{
//				arr[i][j] = 1;
//			}
//			if (i >= 2 && j >= 1)
//			{
//				arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//			}
//		}
//	}
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j < (10 - i) / 2; j++)
//		{
//			printf(" ");
//		}
//		for (j = 0; j <=i; j++)
//		{
//			printf("%d ", arr[i][j]);
//
//		}
//		printf("\n");
//	}
//
//
//	return 0;
//}


//打印一个菱形

   //    *
   //   * *
   //  * * *
   // * * * *
   //  * * *
   //   * *
   //    *
//int main()
//{
//	int n = 0;
//	printf("输入上半部分菱形的行数:>");
//	scanf("%d", &n);
//	int i = 0;
//	int j = 0;
//	//打印上半部分菱形
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < n-i; j++)
//		{
//			printf(" ");
//		}
//		for (j = 0; j <= i; j++)
//		{
//			printf("* ");
//		}
//		printf("\n");
//	}
//	//打印下部分菱形
//	for (i = n - 1; i > 0; i--)
//	{
//		for (j = 0; j < n - i+1; j++)
//		{
//			printf(" ");
//		}
//		for (j = 0; j < i; j++)
//		{
//			printf("* ");
//		}
//		printf("\n");
//	}
//
//
//	return 0;
//}


//猜凶手
// 编程题
//题目；杀手必为4个嫌疑犯中的一个
//以下4个嫌疑犯的供词
//
//A;不是我---1
//B;是C   ---1
//C;是D  ----0
//D;C在胡说--1

//其中3个说真话，一个人说假话

//int main()
//{
//	int killer = 0;
//	for (killer = 'a'; killer <= 'd'; killer++)
//	{
//		if ((killer != 'a') + (killer == 'c') + (killer == 'd') + (killer != 'd') == 3)
//		{
//			printf("killer=%c", killer);
//		}
//	}
//	return 0;
//}

//赛马问题；有36匹🐎，6个跑道，没有计时器，请赛马确定36匹马中的前三名，请问最少比赛几次？---8次

//   1    1  -- --- --   1
//   2    2  -- - -- -   2
//   3    3 - -- -- - -  3     --------》总共6次这边
//   4    4              4
//   5    5              5
//   6    6              6

//再取每一组的第一名进行比赛取出前面三名   --1 1 1 1 1 1----》进行比赛
//第一名----》取出它所在小组的前三名（第一名的可以不用算在内因为已经是36匹马中的第一名了）
//第二名----》取出它所在小组的前面2名
//第三名---》取出它所在小组的第一名（就是自己了）

//取出来的5匹马在进行比较----》取出前2名  


//烧香问题---
//有一种香，材料不均匀，但是每一根这样的香燃烧完全恰好是1个小时
//给你两根香，帮我确定一个15分钟的时间段





































































































