#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//c语言类型
//1.内置类型
// char
// int
// float
// long
// 
//2.自定义类型
//
//int main()
//{
//	int a = 10;
//	float f = 10.0;
//
//	return 0;
//}


//void test(void)
//{
//	printf("hehjh\n");
//}
//int main()
//{
//	test(200);
//	return 0;
//}

//整形在内存中的存储
//int main()
//{
//	int a = 20;//4字节--32bit-
//	//000000000000000000000000000 10100--原码
//	//整数--原反补相同
//	//000000000000000000000000000 10100转换成十六进制
//	//4个二进制位转换成1个十六进制位
//	//000000000000000000000000 0001 0100
//	//0x00000014--0x十六进制表示
//
//	
//	//内存展示的是十六进制--14 00 00 00
//	int b = -10;
//	//10000000000000000000000000001010--原码
//	//11111111111111111111111111110101--反码
//	//11111111111111111111111111110110--补码
//	//1111 1111 1111 1111 1111 1111 1111   0110
//	//f    f    f     f   f    f    f      6
//
//	//内存--f6 ff ff ff
//	//符号位0表示正，1表示负
//
//	return 0;
//}

//计算机中cpu只有加法计算---存放补码是为了统一方便加法跟减法的计算--当然cpu有了加法计算，也就可以计算乘法，除法，减法

//int main()
//{
//	1 - 1;
//
//
//	//1+（-1）用补码计算
//	//00000000000000000000000000000001
//	//11111111111111111111111111111111
//	//100000000000000000000000000000000--只能存32位--最后1直接丢了变成0
//
//
//	//1+(-1)用原码计算--得出来的是-2
//	//00000000000000000000000000000001
//	//10000000000000000000000000000001
//	//10000000000000000000000000000010
//	return 0;
//}

//总结--整数
//1.有符号数--正数-负数
//正数--原，反，补 相同     负数--要分别进行计算

//2.无符号数--原，反，不 相同


//int main()
//{
//	int a = 20;
//	//00000000000000000000000000010100
//	//0000 0000 0000 0000 0000 0000 0001 0100
//	//0    0    0    0    0    0    1    4--应该是  0x 00 00 00 14
//	//但是为什么在内存中确是--0x 14 00 00 00--倒过来的呢
//	//0x 00 00 00 14--占4个字节
//
//	//内存块
//	// 编号小的                                                          编号大的
//	//低地址------------------------------------------------------------》高地址
//	//内存中的存法-- 44 33 22 11  或者11 22 33 44 或者 11 33 44 22等等都可以
//	//不过为了取出时-还原回原来的哪个数字--就不采用11 33 44 22
//
//	//所以一般采用--44 33 22 11--小端存储模式
//	//11 22 33 44--大端存储模式
//
//	//大端（存储）模式--是指的是数据的低位保存在内存的高地址出 -数据的高位保存在内存的低地址处
//	// 123-11 22 33 44--其中44是低位
//	// 
//	//
//	//小端（存储）模式--是指的是数据的低位保存在内存的低地址出 -数据的高位保存在内存的高地址处
//	//123- 44 33 22 11--其中11是高位
//
//	return 0;
//}


//写一段代码，告诉我们当前计算机的字节序
//int main()
//{
//	int a = 20;
//	char* p = (char*) & a;//一个char类型的指针解引用可以访问1个字节的空间
// 
//	if (*p == 1)
//	{
//		printf("小端");
//	}
//	else
//		printf("大端");
//	return 0;
//}


//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	//返回1，小端
//	//返回0，大端
//	return *p;
//}
//int main()
//{
//	int ret=check_sys();
//	if (ret == 1)
//	{
//		printf("小端");
//	}
//	else
//	{
//		printf("大端");
//	}
//	return 0;
//}


//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//int main()
//{
//	int ret=check_sys();
//	if (ret == 1)
//	{
//		printf("小端");
//	}
//	else
//	{
//		printf("大端");
//	}
//	return 0;
//}

//------------>指针类型的意义:
//1.指针类型的意义决定了指针解引用操作符时访问的字节
//char*p;*p 访问一个字节    int*p;*p 访问4个字节
//2.指针类型决定了指针+1，-1加的是几个字节:char*p,p+1,跳过一个字符-一个字节      int*p,p+1;跳过一个整形-4个字节

//int main()
//{
//	int a = 0x11223344;
//	//int* p = &a;
//	//*p = 0;
//	char* p = &a;
//	*p = 0;
//
//	printf("%d", a);
//	return 0;
//}


//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111--补码
//	//转换成char类型-只能存放1个字节--11111111
//	//最后打印的是整形--需要进行整形提升--按照原符号位进行提升
//	//11111111111111111111111111111111--整形提升后的结果---
//
//
//	signed char b = -1;
//	//11111111
//	//11111111111111111111111111111111--整形提升后结果
//
//	unsigned char c = -1;
//	//11111111
//	//unsigned--无符号位--最高位不是符号位--直接补0
//	//00000000000000000000000011111111--提升后的结果
//
//	printf("a=%d,b=%d,c=%d", a, b, c);
//
//
//	return 0;
//}


//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000--补码
//	//10000000
//	//进行整形提升--
//	//11111111111111111111111110000000--补码
//
//
//	printf("%u\n", a);
//	//%d--打印十进制有符号数字
//	//%u是打印十进制无符号数字--原，反，补相同
//
//	return 0;
//}

//char--- 类型
//signed char---有符号char范围--     -128  -  127
//   00000000--0
//   00000001--1
//   00000010--2
//   01111111--127
//
//   1000000--  -128
//   1000001--  -127
//   1111111--  -1
//


//unsigned char--无符号char范围--      0-255
//00000000--0
//00000001--1
//11111111--255
//
































