#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//int main()
//{
//	int arr[10] = { 0 };
//	int i = 0;
//	for (i = 0; i < 9; i++)	
//	{
//		arr[i] = i;
//	}
//	for (i = 0; i < 9; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//	return 0;
//}


//计算机是如何将一个     test.c文件   ----》    test.exe的运行程序

//  test.c             ---------------------------------------> test.exe(格式也是elf)
//|----------------------------------------------------------  --------------
//|          翻译环境                                       |  |运行环境    |
//|----------------------------------------------------------  --------------
//|------------------------------------     ------------------
//|   编译（编译器）                  |    |    链接（链接器）|
//|------------------------------------     -------------------
//--------  ------   --------------------------------------
//|预编译|  |编译 |  |汇编（生成可重定位的目标文件(.obj)） |
//--------  ------   --------------------------------------
//
//        预编译/预处理                 编译                            汇编                           
//------------------------      ----------------------           -----------------------
//| 总结：文本操作        |     |   从把我们的c语言  |          |     把汇编代码        |
//|                       |     |   翻译成我们       |          |   转换成二进制的代码  |
//| 1.#include            |     |   的汇编代码       |          | ----------------------|
//|   头文件的包含        |     | --------------------          |     形成符号表:       |
//| 2.注释的删除          |     |   1.语法分析       |          |                       |
//|  使用空格替换注释     |     |   2.词法分析       |          |    在前面编译阶段     |
//| 3.#define             |     |   3.语义分析       |          | 将汇总的符号形成符号表|
//| 的替换成我们设的值    |     |   4.符号汇总       |          -------------------------
//------------------------      |                    |             
//                              |    符号汇总:       |          
//                              |   main、g_val      |          
//                              |   函数名、全局变量 |          
//                              ----------------------          
//
//
//
//
//             链接
// ----------------------------   1.合并段表  --> 假设一个工程里有两个文件  test.c   与  Add.c  文件
//|1.合并段表（多个.o文件合并）|    在前面经过了翻译的过程后形成了test.o（目标文件）    与Add.o（目标文件）   文件
//|    2.符号表的合并和重定位 |     （.o文件是有固定格式（elf的文件格式）的---》  固定把自己分成几个段）
//-----------------------------                   test.o文件                       Add.o文件                       
//                                   |——————————————|            也是分成这么几个段                               
//                                   |                            |        （无非不同段里放的信息不同）
//                                   |                            |
//                                   |——————————————|
//                                   |                            |
//                                   |                            |
//                                   |——————————————|
//                                   |                            |
//                                   |                            |
//                                   |                            |
//                                   |——————————————|
//       
//
//
//            运行环境
//  |—————————————|
//  | 1.程序必须载到内存中     |
//  |2.程序执行（调用main函数）|
//  |3.开始执行程序代码（使用  |
//  |    一个运行时堆栈存储局部|
//  |   变量和返回地址）       |
//  |4.终止程序                |
//  | ———————————— |



//预编译
//预定义符号（语言本身就已经把这些符号定义好了）

//int main()
//{
//	//printf("%s\n", __FILE__);//绝对路径加上这个文件的名字
//	//printf("%d\n", __LINE__);//得到相应的行号
//
//	//printf("%s\n", __DATE__);
//	//printf("%s\n", __TIME__);
//
//	//写日志文件
//	int i = 0;
//	int arr[10] = { 0 };
//	FILE* pf = fopen("log.txt", "w");
//	for (int i = 0; i < 10; i++)
//	{
//		arr[i] = i;
//		fprintf(pf, "file:%s  line:%d  datE:%s  time:%s  i=%d\n",
//			__FILE__, __LINE__, __DATE__, __TIME__,i);
//		printf("%s\n", __FUNCTION__);//获取函数名
//
//	}
//
//	fclose(pf);
//	pf = NULL;
//
//
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//
//	return 0;
//}

































